Revit 2016 API
LoadNatureCategory Enumeration
 Specifies load case nature.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum LoadNatureCategory
Visual Basic
Public Enumeration LoadNatureCategory
Visual C++
public enum class LoadNatureCategory
Members
Member name | Description
Dead |  Dead
Live |  Live
Wind |  Wind
Snow |  Snow
RoofLive |  Roof Live
Accidental |  Accidental
Temperature |  Temperature
Seismic |  Seismic
See Also
Autodesk.Revit.DB.Structure Namespace